package com.qubaopen.survey.service.mindmap;

public class MapContent {
	
	// 正负情感
	
	public static String highTideTitle = "您处于情绪周期的高潮期\n";
	
	public static String highTideContent = "    目前，您可能会有“春风得意马蹄疾，一日看尽长安花”的感觉，浑身充满着强烈的生命活力，对人和蔼可亲，感情丰富，做事认真，容易接受别人的规劝，具有心旷神怡之感。在此期间，您的工作和学习效率都会提高，建议您安排一些难度大、较繁琐的任务，一鼓作气，消灭困难。\n";
	
	public static String lowTideTitle = "您处于情绪周期低潮期\n";
	
	public static String lowTideContent = "    最近您可能较易急躁和发脾气，易产生反抗情绪，感到孤独与寂寞。建议您在情绪低落时多出去走走，放松思想、放宽心情，有了烦心的事多向亲人、同学、朋友倾诉，寻求心理上的支持，安全地渡过情绪危险期。您要知道“谁无暴风劲雨时,守得云开见月明”。\n";
	
	public static String lowTideMethod = "    为了能更好的渡过低潮期，建议您每天静心5分钟。\n    1. 找个安静角落，未必盘腿坐地，舒服坐在椅子上即可。\n    2. 轻闭眼睛，缓慢深吸一口气，然后放松，把气吐光，再重复吸气。\n    3. 想象从头、颈、肩膀、手、腰、臀、大腿、小腿一直到脚趾头，一次次渐渐放松。\n    4. 为了集中心念，可采取数息法，从1数到10，再回头数到1，重复几次。";

	public static String lowToHighTitle = "您正处于情绪低潮转高潮的“临界期”\n";
	
	public static String lowToHighContent = "    临界期的特点是情绪不稳定，机体各方面的协调性能差，易发生事故。遇上临界期，我们要提高警惕，运用意志加强自我控制，也可以把自己的情绪周期告诉自己最亲密的人，一方面也让他们能提醒你，帮助你克服不良情绪，另一方面避免不良情绪给你们之间带来的误会。您要相信“长风破浪会有时 直挂云帆济沧海”。";
	
	public static String lowToHighMethod = "    调整策略：\n    1．回避和接近策略：选择有利情景，回避不利情景或者较难实现的。\n    2．控制和修正策略：改变情景中各种不利的情绪事件。\n    3.  归因策略：正确认识自身状态，将消极因素归于外界环境而不是自身；同时，我们应当看到自身积极变化，对高潮期充满期待。";

	public static String highToLowTitle = "您正处于情绪高潮转低潮的“临界期”\n";
	
	public static String highToLowContent = "    临界期的特点是情绪不稳定，机体各方面的协调性能差，易发生事故。遇上临界期，我们要提高警惕，运用意志加强自我控制，也可以把自己的情绪周期告诉自己最亲密的人，一方面也让他们能提醒你，帮助你克服不良情绪，另一方面避免不良情绪给你们之间带来的误会。\n";

	public static String highToLowMethod = "    调整策略：\n    1．客观原则策略：正确认识自身的能力水平，知晓自身状态可能会影响绩效。\n    2．摆正心态策略：接纳不完美的自我，允许自身犯错，但吸取教训，不断完善自我。\n    3. 放松心情，尽量先做一些简单重复的工作。\n    您要坚信“天生我材必有用，千金散尽还复来”！";

	public static String within = "    不同性格的人在情绪调节的方式上是有差异的，您这种性格的人倾向于对情绪进行控制和调节；同时，您的负性情绪周期相对短，但较频繁。因此建议您多看到事物的乐观方面，从看问题的认知角度来调节情绪。保持乐观心态的同时，建议您在情绪低落时期多锻炼或旅游，将不良情绪发泄出来。\n";

	public static String outbound = "    不同性格的人在情绪调节的方式上是有差异的，您这种性格的人倾向于将情绪表达出来；同时，您的负性情绪周期相对长，但频次较少。因此建议您在心情低落的时候多与亲近的人诉说心事，将内心纠结的事与他们分享，寻求心理上的支持。\n";


	// EPQ
	public static String epqTitle = "根据您对EPQ量表的测试，经过量表的标准分数换算得到你的性格偏向，如上图。\n";
	
	public static String EGreaterThanPN = "您的性格属于典型的外向性格和典型情绪稳定性格，爱社交、渴望兴奋、冒险、易冲动、情绪失控、反应快、乐观、做事欠踏实。而且情绪反应缓慢，不强烈，而且情绪反应缓慢，不强烈，而且容易平复，很难生气，在一般人难以忍耐的剌激下也有所反应，但不强烈。\n同时您还兼具一些P型性格（孤独），可能是孤独、不关心他人，难以适应外部环境，不近人情，缺乏同情心，敌意，不遵守社会规范，喜欢寻衅搅扰，喜欢干奇特的事。";
	
	public static String EGreaterThanNP = "您的性格属于典型的外向性格和典型友善性格，爱社交、渴望兴奋、冒险、易冲动、情绪失控、反应快、乐观、做事欠踏实。而且能与人相处，较好地适应环境，态度温和，不粗暴，善从人意。\n同时您还兼具一些N型性格（情绪不稳定），表示情绪不稳定—焦虑紧张、易怒、抑郁、睡眠不好、情绪反应强烈。";

	public static String PGreaterThanEN = "您的性格属于典型孤独型性格和情绪稳定性格，可能是孤独、不关心他人，难以适应外部环境，不近人情，缺乏同情心，敌意，不遵守社会规范，喜欢寻衅搅扰，喜欢干奇特的事。而且焦虑紧张、易怒、抑郁、睡眠不好、情绪反应强烈。\n同时您还兼具一些E型性格（外向），爱社交、渴望兴奋、冒险、易冲动、情绪失控、反应快、乐观、做事欠踏实。";

	public static String PGreaterThanNE = "您的性格属于典型孤独性格和典型的内向性格，可能是孤独、不关心他人，难以适应外部环境，不近人情，缺乏同情心，敌意，不遵守社会规范，喜欢寻衅搅扰，喜欢干奇特的事。而且好静、富于内省、交友不广，对一般人缄默冷漠，不惜刺激，喜欢有秩序的生活，情绪较稳定。\n同时您还兼具一些N型性格（情绪不稳定），表示情绪不稳定—焦虑紧张、易怒、抑郁、睡眠不好、情绪反应强烈。";

	public static String NGreaterThanPE = "您的性格属于典型情绪不稳定性格和典型内向性格，表示情绪不稳定—焦虑紧张、易怒、抑郁、睡眠不好、情绪反应强烈。而且好静、富于内省、交友不广，对一般人缄默冷漠，不惜刺激，喜欢有秩序的生活，情绪较稳定。\n同时您还兼具一些P型性格（孤独），可能是孤独、不关心他人，难以适应外部环境，不近人情，缺乏同情心，敌意，不遵守社会规范，喜欢寻衅搅扰，喜欢干奇特的事。";
	
	public static String NGreaterThanEP = "您的性格属于典型情绪不稳定性格和典型友善性格，表示情绪不稳定—焦虑紧张、易怒、抑郁、睡眠不好、情绪反应强烈。而且能与人相处，较好地适应环境，态度温和，不粗暴，善从人意。\n同时您还兼具一些E型性格（外向），爱社交、渴望兴奋、冒险、易冲动、情绪失控、反应快、乐观、做事欠踏实。";

	public static String lieL = "由于量表中测谎题总分过高，故此次结果具有不针对性。\n";

	// ABCD
	
	public static String abcdTitle = "根据您对ABCD量表的测试，经过量表的标准分数换算得到你的性格偏向，如上图。\n";
	
	// A
	public static String extremeA = "您的性格是典型急躁好胜型，具有雄心壮志，争强好胜，节奏紧迫，急躁激动。\n";
	
	public static String obviousA = "您的性格是明显急躁好胜型，具有雄心壮志，争强好胜，节奏紧迫，急躁激动。\n";
	
	public static String tendencyA = "您的性格是有一些急躁好胜倾向，具有雄心壮志，争强好胜，节奏紧迫，急躁激动。\n";
	
	// B
	public static String extremeB = "您的性格是典型的心平气和的，淡泊名利，温和平静，人际和谐，从容缓慢，与世无争，个性中庸。\n";
	
	public static String tendencyB = "您的性格是有一些心平气和的，淡泊名利，温和平静，人际和谐，从容缓慢，与世无争，个性中庸。\n";
	
	// C
	public static String typicalC = "同时您的性格也是典型忍气吞声型，压抑，屈从，无望。	\n";
	
	public static String tendencyC = "同时您的性格也有忍气吞声倾向，压抑，屈从，无望。\n";
	
	public static String notC = "你的性格特征不属于C型的。\n";
	
	// D
	public static String D1 = "你的精神状况非常正常。\n";
	
	public static String D2 = "你平时多多少少有些情绪的波动。\n";
	
	public static String D3 = "你已经到了抑郁症的边缘了，你需要尽快调整自己。\n";
	
	public static String D4 = "你已经有一些轻度的抑郁症了，你必须要重视起来。\n";
	
	public static String D5 = "你已经是重度抑郁症患者了，你必须及时的就医。\n";
	
	public static String D6 = "你已经是极度的抑郁症患者了，你几乎要陷入崩溃了，你应该立即就医。\n";
	
	// SDS
	public static String sds = "    1、社会型（S）：喜欢与人交往、善言谈、愿意教导别人。关心社会问题、渴望发挥自己的社会作用。寻求广泛的人际关系，比较看重社会义务和社会道德。\n    2、企业型（E）：追求权力、权威和物质财富，具有领导才能。喜欢竞争、敢冒风险、有野心、抱负。为人务实，习惯以利益得失，权利、地位、金钱等来衡量做事的价值，做事有较强的目的性。\n    3、常规型（C）:尊重权威和规章制度，喜欢按计划办事，细心、有条理，习惯接受他人的指挥和领导，自己不谋求领导职务。喜欢关注实际和细节情况，通常较为谨慎和保守，缺乏创造性，不喜欢冒险和竞争，富有自我牺牲精神。\n    4、实际型（R）：愿意使用工具从事操作性工作，动手能力强，做事手脚灵活，动作协调。偏好于具体任务，不善言辞，做事保守，较为谦虚。缺乏社交能力，通常喜欢独立做事。\n    5、调研型（I）：思想家而非实干家，抽象思维能力强，求知欲强，善思考，不愿动手。喜欢独立的和富有创造性的工作。知识渊博，不善于领导他人。考虑问题理性，做事喜欢精确，喜欢逻辑分析和推理，不断探讨未知的领域。\n    6、艺术型（A）：有创造力，乐于创造，渴望表现自己的个性，实现自身的价值。做事理想化，追求完美。具有一定的艺术才能和个性。善于表达、怀旧、心态较为复杂。";
}
