package com.qubaopen.survey.service.mindmap;

public class MapMoodContent {
	
	public static String highTideTitle = "您处于情绪周期的高潮期\n";
	
	public static String highTideContent = "    目前，您可能会有“春风得意马蹄疾，一日看尽长安花”的感觉，浑身充满着强烈的生命活力，对人和蔼可亲，感情丰富，做事认真，容易接受别人的规劝，具有心旷神怡之感。在此期间，您的工作和学习效率都会提高，建议您安排一些难度大、较繁琐的任务，一鼓作气，消灭困难。\n";
	
	public static String lowTideTitle = "您处于情绪周期低潮期\n";
	
	public static String lowTideContent = "    最近您可能较易急躁和发脾气，易产生反抗情绪，感到孤独与寂寞。建议您在情绪低落时多出去走走，放松思想、放宽心情，有了烦心的事多向亲人、同学、朋友倾诉，寻求心理上的支持，安全地渡过情绪危险期。您要知道“谁无暴风劲雨时,守得云开见月明”。\n";
	
	public static String lowTideMethod = "    为了能更好的渡过低潮期，建议您每天静心5分钟。\n    1. 找个安静角落，未必盘腿坐地，舒服坐在椅子上即可。\n    2. 轻闭眼睛，缓慢深吸一口气，然后放松，把气吐光，再重复吸气。\n    3. 想象从头、颈、肩膀、手、腰、臀、大腿、小腿一直到脚趾头，一次次渐渐放松。\n    4. 为了集中心念，可采取数息法，从1数到10，再回头数到1，重复几次。";

	public static String lowToHighTitle = "您正处于情绪低潮转高潮的“临界期”\n";
	
	public static String lowToHighContent = "    临界期的特点是情绪不稳定，机体各方面的协调性能差，易发生事故。遇上临界期，我们要提高警惕，运用意志加强自我控制，也可以把自己的情绪周期告诉自己最亲密的人，一方面也让他们能提醒你，帮助你克服不良情绪，另一方面避免不良情绪给你们之间带来的误会。您要相信“长风破浪会有时 直挂云帆济沧海”。";
	
	public static String lowToHighMethod = "    调整策略：\n    1．回避和接近策略：选择有利情景，回避不利情景或者较难实现的。\n    2．控制和修正策略：改变情景中各种不利的情绪事件。\n    3.  归因策略：正确认识自身状态，将消极因素归于外界环境而不是自身；同时，我们应当看到自身积极变化，对高潮期充满期待。";

	public static String highToLowTitle = "您正处于情绪高潮转低潮的“临界期”\n";
	
	public static String highToLowContent = "    临界期的特点是情绪不稳定，机体各方面的协调性能差，易发生事故。遇上临界期，我们要提高警惕，运用意志加强自我控制，也可以把自己的情绪周期告诉自己最亲密的人，一方面也让他们能提醒你，帮助你克服不良情绪，另一方面避免不良情绪给你们之间带来的误会。\n";

	public static String highToLowMethod = "    调整策略：\n    1．客观原则策略：正确认识自身的能力水平，知晓自身状态可能会影响绩效。\n    2．摆正心态策略：接纳不完美的自我，允许自身犯错，但吸取教训，不断完善自我。\n    3. 放松心情，尽量先做一些简单重复的工作。\n    您要坚信“天生我材必有用，千金散尽还复来”！";

	public static String within = "    不同性格的人在情绪调节的方式上是有差异的，您这种性格的人倾向于对情绪进行控制和调节；同时，您的负性情绪周期相对短，但较频繁。因此建议您多看到事物的乐观方面，从看问题的认知角度来调节情绪。保持乐观心态的同时，建议您在情绪低落时期多锻炼或旅游，将不良情绪发泄出来。\n";

	public static String outbound = "    不同性格的人在情绪调节的方式上是有差异的，您这种性格的人倾向于将情绪表达出来；同时，您的负性情绪周期相对长，但频次较少。因此建议您在心情低落的时候多与亲近的人诉说心事，将内心纠结的事与他们分享，寻求心理上的支持。\n";
}
